[
    {
      "name": "Aadil",
      "meaning": "The meaning of the name Aadil is justice. It is a traditional yet very popular baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Ali",
      "meaning": "Ali is a short and sweet Muslim baby boy name starting with letter 'A'. It is a very popular Muslim baby boy name which means excellent or noble.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Amr",
      "meaning": "The meaning of the name Amr is eternal. It is an old Arabic name starting with the letter 'A'",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aali",
      "meaning": "Meaning of the name Aali is high, elevated, exalted, august or excellent. It is a traditional Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aamir",
      "meaning": "Aamir means populous, full, prosperous or rich. It is a traditional yet most popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aws",
      "meaning": "Aws is a short and sweet Muslim baby boy name. It is the name of a tree.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Azb",
      "meaning": "Azb is a Muslim baby boy name which means Sweet. It is a unique baby boy name popular in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abed",
      "meaning": "Abed means a worshipper. It is a short and sweet Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abid",
      "meaning": "The name Abid is the variant of the name Abed. Abid means worshipper of Allah.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Adil",
      "meaning": "Adil means one who is sincere. It is a short, sweet, popular and traditional Muslim baby boy name starting with letter 'A'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Alif",
      "meaning": "Alif is the first character in Hijaiyah. Hijaiyah are the letters symbolizing consonant sounds. It is a traditional Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Kadeem",
      "meaning": "Kadeem is a unique Muslim baby boy name which means slave to Allah.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Alaa",
      "meaning": "Alaa means nobility or excellence. It is a unique baby boy name which is very rarely used in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aariz",
      "meaning": "Aariz means respectable or intelligent. It is a traditional and popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aarif",
      "meaning": "Aarif is a popular Muslim baby boy name which means one who is familiar with things or one who is knowledgeable.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rahil",
      "meaning": "The meaning of the name Rahil is a traveller. This name is a traditional baby boy name and it is very popular in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rahim",
      "meaning": "Rahim is another name for Allah. This name too is a traditional Muslim baby boy name which is very popular in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Raheel",
      "meaning": "The meaning of the name Raheel is the one who shows the way. It is a very popular Muslim baby boy name starting with letter 'R'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saad",
      "meaning": "Saad means good luck. It is a modern and unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nahid",
      "meaning": "Nahid is a popular Muslim baby boy name. It is also used for naming a baby girl. The meaning of this name is Stainless.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saalih",
      "meaning": "Saalih means good or righteous. It is a unique Muslim baby boy name which is not so popular in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saariyah",
      "meaning": "It is a unique Muslim baby boy name. The meaning of this name is clouds at night.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saahir",
      "meaning": "Saahir means wakeful. It is a modern and unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saajid",
      "meaning": "The meaning of the name Saajid is one who worships Allah. It is a very popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saabir",
      "meaning": "Saabir means patient. It is a very popular and unique Muslim baby boy name starting with letter 'S'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Sabeeh",
      "meaning": "The meaning of the name Sabeeh is beautiful. It is a popular and unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nakir",
      "meaning": "It is a Muslim baby name for boys. It is the name of an angel who decides whether a person should go to heaven or hell after he or she dies.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Aasim",
      "meaning": "Aasim means protector. It is a unique Muslim name for boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Jabez",
      "meaning": "Jabez is a Muslim baby boy name which means that your boundary will be increased by Allah.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Sadiq",
      "meaning": "The name Sadiq has a beautiful meaning. The meaning of this Muslim baby boy name is friend.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rabee",
      "meaning": "Rabee means spring. It is a unique Muslim baby boy name beginning with letter 'R'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rabah",
      "meaning": "Rabah means a gainer. It is a modern baby boy name beginning with the letter 'R'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Raakin",
      "meaning": "Raakin is a unique Muslim baby boy name beginning with letter 'R'. The meaning of this name is respectful.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Safiy",
      "meaning": "The Muslim baby boy name Safiy has a wonderful meaning. The meaning of this name is best friend.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Raamiz",
      "meaning": "Raamiz means a symbol. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Raatib",
      "meaning": "Raatib means an arranger. It is a popular and modern Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Safwan",
      "meaning": "It is an old Arabic name which is used for naming Muslim baby boys. The meaning of this baby name is rocks.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Saeed",
      "meaning": "Saeed means happy or a rivulet. It is a popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Sadeeq",
      "meaning": "Sadeeq means trustworthy. It is a popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abaan",
      "meaning": "Abaan is an old Arabic baby boy name used for naming Muslim boys. It is the name of a mountain and it also means something that is clear.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rafee",
      "meaning": "Rafee is a popular Muslim baby boy name. The meaning of this name is a kind friend.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Sahir",
      "meaning": "Sahir means a magician. It is a popular and traditional Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Sahil",
      "meaning": "Sahil means riverbank, shore or kinara. It is a traditional Muslim baby boy name and this name is very popular in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul",
      "meaning": "Abdul is a very popular name in Muslim community. The meaning of this name is Waahid servant of the one.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rajab",
      "meaning": "Is the name of the 7th month of the Muslim year. It is a very unique name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Ragheb",
      "meaning": "Ragheb means desirous. It is a Muslim baby boy name, but it is not so popular among Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Akhil",
      "meaning": "Akhil means world. It is a name for Muslim boys, but it is also popular in other communities of India.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Ra'ed",
      "meaning": "The meaning of the name Ra''ed is leader. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdullah",
      "meaning": "Abdullah is a very popular and traditional Muslim baby boy name. Abdullah means servant of Allah.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Raheem",
      "meaning": "The name Abdul-Raheem is one of the traditional and popular names in Muslim community. The meaning of this name is servant of the most compassionate.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Qahaar",
      "meaning": "Abdul-Qahaar is a traditional name belonging to Muslim community. It means servant of the subduer or the almighty.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Qudoos",
      "meaning": "The meaning of the name Abdul-Qudoos is servant of the most holy. This is a traditional name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abbas",
      "meaning": "Abbas is a traditional and popular Muslim baby boy name. Abbas means lion.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Rasheed",
      "meaning": "Abdul-Rasheed means the servant of the rightly guided. It is a traditional name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Ghafoor",
      "meaning": "Abdul-Ghafoor is a traditional name which means servant of the forgiver. It is an oldest Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Azeez",
      "meaning": "The name Abdul-Azeez has two meanings. It means servant of the mighty or the one who is very powerful.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Baari",
      "meaning": "Abdul Baari is unique name for Muslim baby boys. The meaning of this name is the servant of the creator.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Haafiz",
      "meaning": "Abdul-Haafiz means the servant of the protector. It is a traditional Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Jaleel",
      "meaning": "The meaning of the name Abdul-Jaleel is servant of the great or revered. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Khaaliq",
      "meaning": "Abdul-Khaaliq means the servant of the creator. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Hameed",
      "meaning": "The meaning of the name Abdul-Hameed is the servant of the praiseworthy or the ever-praised. It is a traditional Muslim baby boy name which Muslim parents can consider.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Qaadir",
      "meaning": "Abdul-Qaadir means the servant of the capable. It is a traditional and unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Salaam",
      "meaning": "The name Abdul-Salaam has a unique and a beautiful meaning. It means the servant of the peace.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdal",
      "meaning": "Abdal is a traditional Muslim baby boy name which has unique meaning. The meaning of this name is one who is the substitute of Allah.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Wadood",
      "meaning": "The meaning of the name Abdul-Wadood is servant of the loving. It is a traditional name for Muslim baby boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Raouf",
      "meaning": "The meaning of the name Abdul-Raouf is servant of the most merciful.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Jabaar",
      "meaning": "Abdul-Jabaar is a unique Muslim baby boy name. The meaning of this name is servant of the mighty.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Parwez",
      "meaning": "Parwez is a traditional and unique name for Muslim baby boys. The meaning of this name is victorious or peace.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Razaaq",
      "meaning": "The meaning of Abdul-Razaaq is servant of the maintainer or the provider. It is a unique name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abdul-Haseeb",
      "meaning": "Abdul-Haseeb means the servant of the respected or esteemed. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rameez",
      "meaning": "The meaning of the name Rameez is prince. It is a very traditional baby boy name starting with the letter 'R'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Kahill",
      "meaning": "Kahill means best friend. It is a unique Muslim baby boy name beginning with letter 'K'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rasul Aidil",
      "meaning": "The meaning of the name Rasul Aidil is angel or messenger of Allah. It is a very unique baby name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abedin",
      "meaning": "Abedin means worshipper. It is a very unique Muslim baby boy name starting with letter 'A'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Kaamil",
      "meaning": "Kaamil means perfect. It is a unique baby boy name starting with the letter 'K'. It is a traditional Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Ma\"D",
      "meaning": "It is an old Arabian tribe's name. It is a unique Muslim baby boy name starting with letter 'M'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rashid",
      "meaning": "Rashid is a traditional baby boy name which is very popular in Muslim community. The meaning of this name is rightly guided or having the true faith.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Rashad",
      "meaning": "Rashad means the integrity of conduct. It is a traditional Muslim baby boy name starting with letter 'R'",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Dawoud",
      "meaning": "Dawoud is a popular and traditional Muslim baby boy name. It is a Prophet's name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Baha",
      "meaning": "Baha is a Muslim baby boy name which is very rarely used. The meaning of this name is beautiful or magnificent.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khair Udeen",
      "meaning": "The meaning of the name Khair Udeen is the good of the faith. It is a traditional name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Kareem",
      "meaning": "The meaning of the name Kareem is generous or noble. It is an oldest name for Muslim baby boys, but it is one of the popular names during the modern times.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Karim",
      "meaning": "Majeeda means glorious. It is one of the traditional yet unique Muslim baby girl names.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khaldoon",
      "meaning": "Khaldoon is an old Arabic name beginning with the letter 'K'. This name is rarely used for naming baby boys in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khuzaymah",
      "meaning": "Khuzaymah is a unique Muslim baby boy name. It is also an old Arabic name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khairy",
      "meaning": "Khairy means charitable or beneficent. It is a unique Muslim baby boy name beginning with letter 'K'.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nabhan",
      "meaning": "It is a beautiful name for Muslim boys. The meaning of this name is noble or outstanding.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naeem",
      "meaning": "Naeem is a traditional Muslim baby boy name beginning with letter 'N. The meaning of this name is comfort, ease or tranquil.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khaleel",
      "meaning": "Khaleel is a traditional Muslim baby boy name which means a friend. It is one of the popular names in Muslim community.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Khalid",
      "meaning": "Khalid means eternal. It is a traditional and popular Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Houd",
      "meaning": "Houd is Prophet\"s name. It is a traditional and unique name for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nabeeh",
      "meaning": "Nabeeh is a very rarely known Muslim baby name. The meaning of this name is noble or outstanding.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nadeem",
      "meaning": "Nadeem is a traditional and popular Muslim baby boy name. The meaning of this name is friend.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naajy",
      "meaning": "Naajy means safe. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Nabeel",
      "meaning": "Nabeel means noble. It is a very rarely used and unique Muslim name for boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Abul Khayr",
      "meaning": "The name Abul Khayr has a very beautiful meaning. It means one who does good.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naathim",
      "meaning": "Naathim means arranger or adjuster. It is an interesting name for Muslim baby boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naadir",
      "meaning": "Naadir means dear or rare. It is one of the traditional names for Muslim boys.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naasih",
      "meaning": "Naasih is a traditional and unique Muslim baby boy name. The meaning of this name is advisor.",
      "Religion": "muslim",
      "Gender": "Male"
    },
    {
      "name": "Naa\"Il",
      "meaning": "Naa\"il - means acquirer or earner. It is a unique Muslim baby boy name.",
      "Religion": "muslim",
      "Gender": "Male"
    }
  ]